第2課題/Bookers1/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = 'successfully created.'
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test1"], ["body", "test1"], ["created_at", "2024-11-20 07:35:23.154856"], ["updated_at", "2024-11-20 07:35:23.154856"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "aa"], ["updated_at", "2024-11-21 03:07:38.319539"], ["id", 12]]