rails/sample_app/app/controllers/lists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test1"], ["body", "test1"], ["created_at", "2024-11-15 07:24:52.216678"], ["updated_at", "2024-11-15 07:24:52.216678"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 5]]
---
  def destroy
    list = List.find(params[:id])
    list.destroy

SELECT "lists".* FROM "lists"
---
  def index
    @lists = List.all

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @list = List.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "test2"], ["body", "test2"], ["updated_at", "2024-11-18 10:58:15.545815"], ["id", 2]]
---
  def update
    list = List.find(params[:id])
    list.update(list_params)